IDEA StatiCa Open Model
SteelSetupHKG Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Steel setup IND class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupHKG
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SteelSetupHKG : SteelSetup
Public Class SteelSetupHKG
	Inherits SteelSetup
public ref class SteelSetupHKG : public SteelSetup
The SteelSetupHKG type exposes the following members.
Constructors
Name | Description
SteelSetupHKG
Initializes a new instance of the SteelSetupHKG class
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
 (Overrides SteelSetup.FrictionCoefficientPboltDefault().)
Top
See Also
Reference
IdeaRS.OpenModel Namespace